{
  "file_name": "Welcome",
  "file_path": "C:\\Users\\lyndz\\Downloads\\hypercode PROJECT\\hypercode\\src\\core\\hypercode-\\Welcome",
  "file_size": 2603,
  "created": "2025-11-19T22:58:45.103498",
  "modified": "2025-11-19T22:58:56.897880",
  "file_type": "other",
  "content_hash": "cb1326ddc4d29957168a988e8756f110",
  "content_type": "text/unknown",
  "content": "```text\nWelcome — thank you for contributing to HyperCode!\n\nOur goal\nHyperCode is built for and by a global community, with neurodivergent-first design as a core principle. This doc explains how to contribute, how we review, and how we make collaboration inclusive and sustainable.\n\nWays to contribute\n- Report bugs: open an issue with reproduction steps and environment details.\n- Propose features: open an issue labeled \"proposal\" with use cases and expected outcomes.\n- Submit code: open a pull request with tests and documentation.\n- Improve docs or examples: PRs that make the language easier to learn are highly valued.\n- Accessibility & UX: share lived experience, test examples, or propose design changes.\n\nIssue guidelines\n- Use plain, concrete language and include reproducible steps.\n- Include screenshots, short screencasts, or the smallest example that reproduces the problem.\n- Add the \"accessibility\" or \"neurodiversity-impact\" label if the issue affects accessibility or cognitive ergonomics.\n\nPull request guidelines\n- Branch name: feature/<short-description> or fix/<short-description>\n- PR title: short, descriptive — \"feat: add X\" or \"fix: Y\"\n- Include a short description of the change, motivation, and any migration steps.\n- Link related issues with \"Fixes #<number>\" when appropriate.\n- Add tests and update docs/examples as needed.\n- Run the test suite and make sure CI is green before requesting review.\n- Use the checklist in .github/PULL_REQUEST_TEMPLATE.md and add a short note about accessibility/neurodiversity impact.\n\nReview process\n- We aim to respond to PRs within 5 business days.\n- Reviewers will focus on clarity, correctness, tests, security, and accessibility.\n- If you need more time addressing review comments, leave a short status update on the PR.\n\nCommunication & accommodations\n- If you need changes to the review process for accessibility or neurodivergence (e.g., longer review windows, different formats for feedback), say so in the PR or contact a maintainer privately.\n- We expect everyone to act in line with the CODE_OF_CONDUCT. See that file for reporting.\n\nCode style & testing\n- Follow existing style in /src and examples.\n- Add unit/integration tests for new behavior.\n- Keep changes small and focused where possible.\n\nSigning off\n- Include a short \"how I tested\" section in the PR description.\n- For large contributions, consider opening a design/architecture issue first to discuss approach.\n\nThanks for contributing — your work helps make HyperCode better and more inclusive for everyone.\n```",
  "metadata": {},
  "relative_path": "src\\core\\hypercode-\\Welcome",
  "id": "9368c58063141e3aba8063a81d2531a4"
}